추가회고 :

# Movielens 영화추천실습   
- 별점 데이터는 explicit data이지만, implicit data로 간주하고 테스트해 볼 수 있음   
- 별점 = 시청횟수로 해석하기   
- 별점 3점 미만 = 선호하지 않는 영화로 가정

# 1. 데이터 준비 및 전처리

In [18]:
import pandas as pd
import os
rating_file_path=os.getenv('HOME') + '/aiffel/recommendata_iu/data/ml-1m/ratings.dat'
ratings_cols = ['user_id', 'movie_id', 'ratings', 'timestamp']
ratings = pd.read_csv(rating_file_path, sep='::', names=ratings_cols, engine='python', encoding = "ISO-8859-1")
orginal_data_size = len(ratings)
ratings.head()

   user_id  movie_id  ratings  timestamp
0        1      1193        5  978300760
1        1       661        3  978302109
2        1       914        3  978301968
3        1      3408        4  978300275
4        1      2355        5  978824291

In [19]:
# 3점 이상만 남깁니다.
ratings = ratings[ratings['ratings']>=3]
filtered_data_size = len(ratings)

print(f'orginal_data_size: {orginal_data_size}, filtered_data_size: {filtered_data_size}')
print(f'Ratio of Remaining Data is {filtered_data_size / orginal_data_size:.2%}')

orginal_data_size: 1000209, filtered_data_size: 836478
Ratio of Remaining Data is 83.63%

3점 이상만 남긴 데이터 수 = 1000209
전체 데이터 중 약 84%가 남은 것을 볼 수 있다

In [20]:
# ratings 컬럼의 이름을 counts로 바꿉니다.
ratings.rename(columns={'ratings':'counts'}, inplace=True)

In [21]:
ratings['counts']

0          5
1          3
2          3
3          4
4          5
          ..
1000203    3
1000205    5
1000206    5
1000207    4
1000208    4
Name: counts, Length: 836478, dtype: int64

In [22]:
# 영화 제목을 보기 위해 메타 데이터를 읽어옵니다.
movie_file_path=os.getenv('HOME') + '/aiffel/recommendata_iu/data/ml-1m/movies.dat'
cols = ['movie_id', 'title', 'genre'] 
movies = pd.read_csv(movie_file_path, sep='::', names=cols, engine='python', encoding='ISO-8859-1')
movies.head()

   movie_id                               title                         genre
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [23]:
movies["title" ] = movies["title"].str.lower()

영화 제목을 추가하기 위해 두 데이터 프레임 병합하기

In [24]:
movie_re = pd.merge(ratings, movies)
movie_re.head()

,user_id,movie_id,counts,timestamp,title,genre
0,1,1193,5,978300760,one flew over the cuckoo's nest (1975),Drama
1,2,1193,5,978298413,one flew over the cuckoo's nest (1975),Drama
2,12,1193,4,978220179,one flew over the cuckoo's nest (1975),Drama
3,15,1193,4,978199279,one flew over the cuckoo's nest (1975),Drama
4,17,1193,5,978158471,one flew over the cuckoo's nest (1975),Drama

In [25]:
# 사용하는 컬럼만 남겨줍니다.
using_cols = [ 'user_id','title', 'counts']
movie_re = movie_re[using_cols]
movie_re.head(10)

   user_id                                   title  counts
0        1  one flew over the cuckoo's nest (1975)       5
1        2  one flew over the cuckoo's nest (1975)       5
2       12  one flew over the cuckoo's nest (1975)       4
3       15  one flew over the cuckoo's nest (1975)       4
4       17  one flew over the cuckoo's nest (1975)       5
5       18  one flew over the cuckoo's nest (1975)       4
6       19  one flew over the cuckoo's nest (1975)       5
7       24  one flew over the cuckoo's nest (1975)       5
8       28  one flew over the cuckoo's nest (1975)       3
9       33  one flew over the cuckoo's nest (1975)       5

### 영화 제목에서 제목과 연도 분리   
- 최종 결과물에는 사용하지 않았지만 처음 데이터 전처리 때 사용했었음

In [73]:
names = pd.merge(ratings, movies)
name = names.copy()
name.head()

,user_id,movie_id,counts,timestamp,title,genre
0,1,1193,5,978300760,one flew over the cuckoo's nest (1975),Drama
1,2,1193,5,978298413,one flew over the cuckoo's nest (1975),Drama
2,12,1193,4,978220179,one flew over the cuckoo's nest (1975),Drama
3,15,1193,4,978199279,one flew over the cuckoo's nest (1975),Drama
4,17,1193,5,978158471,one flew over the cuckoo's nest (1975),Drama

In [74]:
name[['movie_name', 'year']] = name['title'].str.split('(', n=1, expand=True)
name["year"] = name["year"].str.replace(pat=r')', repl=r'', regex=True)
name.head()

,user_id,movie_id,counts,timestamp,title,genre,movie_name,year
0,1,1193,5,978300760,one flew over the cuckoo's nest (1975),Drama,one flew over the cuckoo's nest,1975
1,2,1193,5,978298413,one flew over the cuckoo's nest (1975),Drama,one flew over the cuckoo's nest,1975
2,12,1193,4,978220179,one flew over the cuckoo's nest (1975),Drama,one flew over the cuckoo's nest,1975
3,15,1193,4,978199279,one flew over the cuckoo's nest (1975),Drama,one flew over the cuckoo's nest,1975
4,17,1193,5,978158471,one flew over the cuckoo's nest (1975),Drama,one flew over the cuckoo's nest,1975

# 2. 데이터 분석하기

- ratigns에 있는 유니크한 영화 개수

In [26]:
uniq_movie = movie_re["title"].nunique()
uniq_movie

3628

In [27]:
uniq_user = movie_re["user_id"].nunique()
uniq_user

6039

In [28]:
pop_movie = movie_re.groupby("title")['user_id'].count()
pop_movie.sort_values(ascending=False).head(30)

title
american beauty (1999)                                   3211
star wars: episode iv - a new hope (1977)                2910
star wars: episode v - the empire strikes back (1980)    2885
star wars: episode vi - return of the jedi (1983)        2716
saving private ryan (1998)                               2561
terminator 2: judgment day (1991)                        2509
silence of the lambs, the (1991)                         2498
raiders of the lost ark (1981)                           2473
back to the future (1985)                                2460
matrix, the (1999)                                       2434
jurassic park (1993)                                     2413
sixth sense, the (1999)                                  2385
fargo (1996)                                             2371
braveheart (1995)                                        2314
men in black (1997)                                      2297
schindler's list (1993)                                  2257
princess bride, the (1987)                               2252
shakespeare in love (1998)                               2213
l.a. confidential (1997)                                 2210
shawshank redemption, the (1994)                         2194
godfather, the (1972)                                    2167
groundhog day (1993)                                     2121
e.t. the extra-terrestrial (1982)                        2102
being john malkovich (1999)                              2066
ghostbusters (1984)                                      2051
pulp fiction (1994)                                      2030
forrest gump (1994)                                      2022
terminator, the (1984)                                   2019
toy story (1995)                                         2000
fugitive, the (1993)                                     1941
Name: user_id, dtype: int64

In [29]:
pop_movie.sort_values(ascending=True).head(100)

title
brother's kiss, a (1997)                                              1
ten benny (1997)                                                      1
condition red (1995)                                                  1
telling you (1998)                                                    1
jeanne and the perfect guy (jeanne et le garçon formidable) (1998)    1
                                                                     ..
mirage (1995)                                                         1
24-hour woman (1998)                                                  1
voyage to the beginning of the world (1997)                           1
wend kuuni (god's gift) (1982)                                        1
last of the high kings, the (a.k.a. summer fling) (1996)              1
Name: user_id, Length: 100, dtype: int64

In [30]:
movie_re[movie_re["title"].str.contains("little")]

        user_id                       title  counts
181297        3  little mermaid, the (1989)       4
181298        6  little mermaid, the (1989)       4
181299       10  little mermaid, the (1989)       5
181300       18  little mermaid, the (1989)       5
181301       19  little mermaid, the (1989)       3
...         ...                         ...     ...
832470     3363          little city (1998)       3
832471     4771          little city (1998)       4
835724     1298           little men (1998)       4
835725     5411           little men (1998)       3
836473     5851    one little indian (1973)       5

[5360 rows x 3 columns]

In [31]:
#[[ your code ]]
# 본인이 좋아하시는 아티스트 데이터로 바꿔서 추가하셔도 됩니다! 단, 이름은 꼭 데이터셋에 있는 것과 동일하게 맞춰주세요. 
my_favorite = ['toy story (1995)' , 'for ever mozart (1996)' ,'e.t. the extra-terrestrial (1982)' ,'terminator 2: judgment day (1991)' ,'little mermaid, the (1989)']

# 'zimin'이라는 user_id가 위 아티스트의 노래를 30회씩 들었다고 가정하겠습니다.
my_list = pd.DataFrame({'user_id': ['mini']*5, 'title': my_favorite, 'counts':[5]*5})

if not movie_re.isin({'user_id':['mini']})['user_id'].any():  # user_id에 'zimin'이라는 데이터가 없다면
    movie_re = movie_re.append(my_list)                           # 위에 임의로 만든 my_favorite 데이터를 추가해 줍니다. 

movie_re.tail(10)       # 잘 추가되었는지 확인해 봅시다.

       user_id                                              title  counts
836473    5851                           one little indian (1973)       5
836474    5854                              slaughterhouse (1987)       4
836475    5854             promise, the (versprechen, das) (1994)       3
836476    5938        five wives, three secretaries and me (1998)       4
836477    5948  identification of a woman (identificazione di ...       5
0         mini                                   toy story (1995)       5
1         mini                             for ever mozart (1996)       5
2         mini                  e.t. the extra-terrestrial (1982)       5
3         mini                  terminator 2: judgment day (1991)       5
4         mini                         little mermaid, the (1989)       5

In [32]:
# 사용하는 컬럼만 남겨줍니다.
using_cols2 = [ 'user_id','title', 'counts']
movie_re = movie_re[using_cols2]
movie_re.tail(10)

       user_id                                              title  counts
836473    5851                           one little indian (1973)       5
836474    5854                              slaughterhouse (1987)       4
836475    5854             promise, the (versprechen, das) (1994)       3
836476    5938        five wives, three secretaries and me (1998)       4
836477    5948  identification of a woman (identificazione di ...       5
0         mini                                   toy story (1995)       5
1         mini                             for ever mozart (1996)       5
2         mini                  e.t. the extra-terrestrial (1982)       5
3         mini                  terminator 2: judgment day (1991)       5
4         mini                         little mermaid, the (1989)       5

In [35]:
# 고유한 유저, 아티스트를 찾아내는 코드
user_unique = movie_re['user_id'].unique()
movie_unique = movie_re['title'].unique()

# 유저, 아티스트 indexing 하는 코드 idx는 index의 약자입니다.
user_to_idx = {v:k for k,v in enumerate(user_unique)}
movie_to_idx = {v:k for k,v in enumerate(movie_unique)}

In [36]:
# 인덱싱이 잘 되었는지 확인해 봅니다. 
print(user_to_idx['mini'])    # 358869명의 유저 중 마지막으로 추가된 유저이니 358868이 나와야 합니다. 
print(movie_to_idx['little mermaid, the (1989)'])

6039
191

In [37]:
# indexing을 통해 데이터 컬럼 내 값을 바꾸는 코드
# dictionary 자료형의 get 함수는 https://wikidocs.net/16 을 참고하세요.

# user_to_idx.get을 통해 user_id 컬럼의 모든 값을 인덱싱한 Series를 구해 봅시다. 
# 혹시 정상적으로 인덱싱되지 않은 row가 있다면 인덱스가 NaN이 될 테니 dropna()로 제거합니다. 
temp_user_data = movie_re['user_id'].map(user_to_idx.get).dropna()
if len(temp_user_data) == len(movie_re):   # 모든 row가 정상적으로 인덱싱되었다면
    print('user_id column indexing OK!!')
    movie_re['user_id'] = temp_user_data   # data['user_id']을 인덱싱된 Series로 교체해 줍니다. 
else:
    print('user_id column indexing Fail!!')

# artist_to_idx을 통해 artist 컬럼도 동일한 방식으로 인덱싱해 줍니다. 
temp_movie_data = movie_re['title'].map(movie_to_idx.get).dropna()
if len(temp_movie_data) == len(movie_re):
    print('movie column indexing OK!!')
    movie_re['title'] = temp_movie_data
else:
    print('movie column indexing Fail!!')

movie_re

user_id column indexing OK!!
movie column indexing OK!!

    user_id  title  counts
0         0      0       5
1         1      0       5
2         2      0       4
3         3      0       4
4         4      0       5
..      ...    ...     ...
0      6039     40       5
1      6039   3035       5
2      6039     26       5
3      6039     92       5
4      6039    191       5

[836483 rows x 3 columns]

# 3. CSR matrix 구성

In [38]:
# 실습 위에 설명보고 이해해서 만들어보기
from scipy.sparse import csr_matrix

num_user = movie_re['user_id'].nunique()
num_movie = movie_re['title'].nunique()

csr_data = csr_matrix((movie_re.counts, (movie_re.user_id, movie_re.title)), shape= (num_user, num_movie))
csr_data

<6040x3628 sparse matrix of type '<class 'numpy.int64'>'
	with 836483 stored elements in Compressed Sparse Row format>

# 4. 모델 구성 및 훈련

In [39]:
from implicit.als import AlternatingLeastSquares
import os
import numpy as np

# implicit 라이브러리에서 권장하고 있는 부분입니다. 학습 내용과는 무관합니다.
os.environ['OPENBLAS_NUM_THREADS']='1'
os.environ['KMP_DUPLICATE_LIB_OK']='True'
os.environ['MKL_NUM_THREADS']='1'

In [40]:
# Implicit AlternatingLeastSquares 모델의 선언
als_model = AlternatingLeastSquares(factors=100, regularization=0.01, use_gpu=False, iterations=15, dtype=np.float32)

In [41]:
# als 모델은 input으로 (item X user 꼴의 matrix를 받기 때문에 Transpose해줍니다.)
csr_data_transpose = csr_data.T
csr_data_transpose

<3628x6040 sparse matrix of type '<class 'numpy.int64'>'
	with 836483 stored elements in Compressed Sparse Column format>

In [42]:
als_model.fit(csr_data_transpose)

  0%|          | 0/15 [00:00<?, ?it/s]

In [43]:
mini,little = user_to_idx['mini'], movie_to_idx['little mermaid, the (1989)']
mini_vector, little_vector = als_model.user_factors[mini], als_model.item_factors[little]

In [44]:
mini_vector

array([ 0.05941531,  0.3927876 , -0.7892087 , -0.39201802,  0.30669424,
        0.3469995 , -0.661698  , -0.08668757,  0.17617789, -0.7970931 ,
        0.43003437, -0.02096749,  0.73633295, -0.6126183 , -0.03529037,
       -0.47127596, -0.44982365,  0.38496354,  0.17879497, -0.26309142,
        0.26808468,  0.80263585,  0.3571348 ,  0.39076996, -0.4422805 ,
       -0.33206955, -0.20451064, -0.33408338, -0.2505414 ,  0.0953524 ,
        0.03944165, -0.07923462, -0.5444406 , -0.28951848, -0.08039405,
        0.2260113 ,  0.08574587,  0.09871911,  0.43097192, -0.44676176,
       -0.19780552, -0.05268591, -0.899637  , -0.26380962, -0.5371994 ,
        0.0861238 , -1.0113691 , -0.30600497,  0.3219601 ,  0.04753207,
        0.41386062,  0.80516446, -0.03861525, -0.35222915,  0.16476952,
       -0.26375854, -0.19334699,  0.82817197, -0.04441024,  0.07177193,
        0.17763463,  0.45019257,  0.86284137, -0.25514773,  0.7337848 ,
       -0.5854809 , -1.0010043 ,  0.20344597,  0.46449828, -0.5077674 ,
        0.4849391 , -0.51842844,  0.15697016,  0.02058242, -0.4360262 ,
       -0.57784116,  0.57540977,  0.09183273,  0.27832744,  0.8035322 ,
        0.21425867,  0.05349209,  0.19748195, -0.72189987,  0.42813256,
        1.120741  ,  0.5711214 , -0.01131511, -0.12157195, -0.02952216,
       -0.02942468, -0.5947529 , -0.37037995, -0.546642  ,  0.31999347,
        0.74381214,  0.6808336 ,  0.71425927,  0.54140973,  0.49581373],
      dtype=float32)

In [45]:
little_vector

array([ 1.96269546e-02,  2.20035645e-03, -4.03903367e-04, -1.51653616e-02,
        6.75128493e-03,  1.81697458e-02, -1.75730735e-02,  3.55953886e-03,
       -2.19648145e-02,  7.27814404e-05,  1.88286602e-02,  3.12026311e-03,
       -7.10651278e-04, -7.60561367e-03,  7.95748457e-03,  8.45090300e-03,
        8.66291055e-04,  2.43354589e-02, -6.87269261e-03,  3.01815034e-03,
       -1.21926516e-03,  2.63998322e-02,  1.26457531e-02,  1.03314379e-02,
        5.87659655e-03,  3.51014221e-03,  2.50312369e-02, -5.34626050e-03,
       -2.60047223e-02,  2.50285435e-02,  9.32532921e-03,  2.27770712e-02,
        1.66501768e-03, -5.28210541e-03, -2.25814129e-03,  1.38743948e-02,
        2.45633330e-02,  1.02917198e-02,  9.35898349e-03, -2.39450708e-02,
       -1.62011001e-03,  3.89200356e-03,  7.63193285e-03,  1.07405055e-02,
       -1.26138199e-02, -9.47808009e-03, -2.54082331e-03, -1.33979488e-02,
       -1.04280394e-02,  9.29781701e-03,  1.67873818e-02,  1.12460069e-02,
       -2.07052995e-02, -1.03158597e-02,  2.29435097e-02, -8.54416285e-03,
        2.07306817e-02,  1.44316033e-02, -1.63738318e-02,  5.52935898e-03,
        2.44218553e-03, -1.09774452e-02,  1.43629219e-02,  3.15452814e-02,
        2.29572989e-02, -3.20718139e-02, -1.17785307e-02,  1.32812560e-02,
       -3.78557760e-03,  6.52734004e-03,  8.69613048e-03, -1.42054344e-02,
        1.47444988e-02,  1.51844928e-02,  1.43623091e-02, -2.25258265e-02,
        2.53483858e-02,  4.74402029e-03,  6.62239781e-03,  2.80909203e-02,
        3.11373845e-02,  2.34901123e-02,  1.26329251e-04, -1.14458883e-02,
        1.65526457e-02,  2.10328568e-02,  1.94941256e-02, -2.00264193e-02,
        8.41143727e-03,  2.59562698e-03, -8.93547386e-03, -2.21884786e-03,
        1.28928162e-02, -1.25433262e-02,  4.42668833e-02,  1.77124497e-02,
       -3.51053406e-03,  7.88944308e-03,  5.62981609e-03,  7.64524084e-05],
      dtype=float32)

In [46]:
#user와 name 내적하는 코드
np.dot(mini_vector, little_vector)

0.32591364

내적 수치가 생각보다 많이 적게 나왔다.

In [47]:
another = movie_to_idx['one little indian (1973)']
another_vector = als_model.item_factors[another]
np.dot(mini_vector, another_vector)

0.0010944406

In [48]:
als_model2 = AlternatingLeastSquares(factors=100, regularization=0.01, use_gpu=False, iterations=100, dtype=np.float32)

In [49]:
als_model2.fit(csr_data_transpose)

  0%|          | 0/100 [00:00<?, ?it/s]

In [50]:
mini2,little2 = user_to_idx['mini'], movie_to_idx['little mermaid, the (1989)']
mini_vector2, little_vector2 = als_model2.user_factors[mini2], als_model2.item_factors[little2]

In [51]:
np.dot(mini_vector2, little_vector2)

0.3106021

In [52]:
another = movie_to_idx['one little indian (1973)']
another_vector2 = als_model2.item_factors[another]
np.dot(mini_vector2, another_vector2)

-0.0011914234

# 5. 비슷한 영화 찾기

In [53]:
favorite_movie = 'toy story (1995)'
movie_id = movie_to_idx[favorite_movie]
similar_movie = als_model.similar_items(movie_id, N=15)
similar_movie

[(40, 1.0000001),
 (50, 0.79849184),
 (322, 0.61320984),
 (33, 0.58446527),
 (4, 0.56920904),
 (110, 0.5153722),
 (330, 0.45393234),
 (10, 0.41389838),
 (20, 0.40899098),
 (255, 0.3773371),
 (277, 0.3478151),
 (34, 0.34670112),
 (126, 0.34325024),
 (32, 0.3341535),
 (475, 0.32820478)]

In [54]:
idx_to_movie = {v:k for k,v in movie_to_idx.items()}
[idx_to_movie[i[0]] for i in similar_movie]

['toy story (1995)',
 'toy story 2 (1999)',
 'babe (1995)',
 'aladdin (1992)',
 "bug's life, a (1998)",
 'groundhog day (1993)',
 'lion king, the (1994)',
 'beauty and the beast (1991)',
 'pleasantville (1998)',
 "there's something about mary (1998)",
 'babe: pig in the city (1998)',
 'mulan (1998)',
 'shakespeare in love (1998)',
 'hercules (1997)',
 'my cousin vinny (1992)']

In [55]:
def get_similar_movie(movie_name: str):
    movie_id = movie_to_idx[movie_name]
    similar_movie = als_model.similar_items(movie_id)
    similar_movie = [idx_to_movie[i[0]] for i in similar_movie]
    return similar_movie

In [56]:
get_similar_movie('mulan (1998)')

['mulan (1998)',
 'tarzan (1999)',
 'hunchback of notre dame, the (1996)',
 'antz (1998)',
 'hercules (1997)',
 'rescuers down under, the (1990)',
 'anastasia (1997)',
 'lion king, the (1994)',
 'pocahontas (1995)',
 'balto (1995)']

In [57]:
def get_similar_movie2(movie_name: str):
    movie_id = movie_to_idx[movie_name]
    similar_movie = als_model2.similar_items(movie_id)
    similar_movie = [idx_to_movie[i[0]] for i in similar_movie]
    return similar_movie

In [58]:
get_similar_movie2('mulan (1998)')

['mulan (1998)',
 'tarzan (1999)',
 'antz (1998)',
 'hunchback of notre dame, the (1996)',
 'hercules (1997)',
 'anastasia (1997)',
 'rescuers down under, the (1990)',
 'lion king, the (1994)',
 'balto (1995)',
 'aladdin and the king of thieves (1996)']

intertation을 다르게 한 두 모델의 비슷한 영화 찾는 것이 다른 것을 볼 수 있다

# 6. 유저에게 영화 추천하기

In [59]:
user = user_to_idx['mini']
# recommend에서는 user*item CSR Matrix를 받습니다.
movie_recommended = als_model.recommend(user, csr_data, N=20, filter_already_liked_items=True)
movie_recommended

[(50, 0.41778946),
 (33, 0.3860776),
 (124, 0.3662512),
 (322, 0.3339877),
 (4, 0.3293299),
 (107, 0.29298323),
 (10, 0.29239398),
 (330, 0.2657994),
 (200, 0.26459154),
 (22, 0.26091754),
 (175, 0.25606117),
 (126, 0.23739219),
 (317, 0.23291013),
 (141, 0.22678405),
 (62, 0.21142104),
 (87, 0.20750043),
 (547, 0.2060605),
 (9, 0.19341266),
 (45, 0.19082755),
 (117, 0.18901774)]

In [60]:
[idx_to_movie[i[0]] for i in movie_recommended]

['toy story 2 (1999)',
 'aladdin (1992)',
 'matrix, the (1999)',
 'babe (1995)',
 "bug's life, a (1998)",
 'jurassic park (1993)',
 'beauty and the beast (1991)',
 'lion king, the (1994)',
 'terminator, the (1984)',
 'back to the future (1985)',
 'men in black (1997)',
 'shakespeare in love (1998)',
 'twelve monkeys (1995)',
 'fugitive, the (1993)',
 'total recall (1990)',
 'braveheart (1995)',
 'lady and the tramp (1955)',
 'wizard of oz, the (1939)',
 'mary poppins (1964)',
 'star wars: episode v - the empire strikes back (1980)']

- explain으로 추천 기여한 정도 확인하기

In [61]:
aladdin  = movie_to_idx['aladdin (1992)']
explain = als_model.explain(user, csr_data, itemid=aladdin)

In [62]:
[(idx_to_movie[i[0]], i[1]) for i in explain[1]]

[('toy story (1995)', 0.18506658348104105),
 ('little mermaid, the (1989)', 0.15578983831679477),
 ('e.t. the extra-terrestrial (1982)', 0.02234649989564951),
 ('terminator 2: judgment day (1991)', 0.015818263713844365),
 ('for ever mozart (1996)', 0.0015375544215073048)]

In [63]:
jurassic  = movie_to_idx['jurassic park (1993)']
explain2 = als_model.explain(user, csr_data, itemid=jurassic)

In [64]:
[(idx_to_movie[i[0]], i[1]) for i in explain2[1]]

[('terminator 2: judgment day (1991)', 0.2941737613957205),
 ('little mermaid, the (1989)', 0.009682425474722282),
 ('for ever mozart (1996)', 0.0009134455126510765),
 ('e.t. the extra-terrestrial (1982)', 0.0004676389123955759),
 ('toy story (1995)', -0.017140351388566913)]

In [65]:
movie_recommended2 = als_model2.recommend(user, csr_data, N=20, filter_already_liked_items=True)

In [66]:
[idx_to_movie[i[0]] for i in movie_recommended2]

['aladdin (1992)',
 'toy story 2 (1999)',
 'matrix, the (1999)',
 'beauty and the beast (1991)',
 'lion king, the (1994)',
 "bug's life, a (1998)",
 'babe (1995)',
 'back to the future (1985)',
 'jurassic park (1993)',
 'terminator, the (1984)',
 'men in black (1997)',
 'fugitive, the (1993)',
 'nightmare before christmas, the (1993)',
 'twelve monkeys (1995)',
 'total recall (1990)',
 'star wars: episode v - the empire strikes back (1980)',
 'groundhog day (1993)',
 'mary poppins (1964)',
 'shakespeare in love (1998)',
 'wizard of oz, the (1939)']

In [67]:
matrix  = movie_to_idx['matrix, the (1999)']
explain3 = als_model.explain(user, csr_data, itemid=matrix)

In [68]:
[(idx_to_movie[i[0]], i[1]) for i in explain3[1]]

[('terminator 2: judgment day (1991)', 0.2850671872759224),
 ('toy story (1995)', 0.0532173120436792),
 ('e.t. the extra-terrestrial (1982)', 0.03479461432467352),
 ('for ever mozart (1996)', 0.000754075930084838),
 ('little mermaid, the (1989)', -0.012919147267480316)]